#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```

terraform
module.ecs.aws_ecs_task_definition.taskdef: Refreshing state... [id=ecs-demo]
module.ecr.aws_ecr_repository.ecr: Refreshing state... [id=machamp-repository]
module.ecs.aws_ecs_cluster.cluster: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:762742784206:cluster/machamp-staging-cluster]
module.network.aws_vpc.vpc: Refreshing state... [id=vpc-036ede2188fe822b8]
module.ecr.aws_ecr_lifecycle_policy.ecr_lifecycle: Refreshing state... [id=machamp-repository]
module.network.aws_subnet.public["ap-northeast-1c"]: Refreshing state... [id=subnet-058faf506e28b7ed9]
module.network.aws_subnet.private["ap-northeast-1a"]: Refreshing state... [id=subnet-096b3c54d4e0a6872]
module.network.aws_subnet.private["ap-northeast-1c"]: Refreshing state... [id=subnet-0a305ab5f27cd389d]
module.network.aws_route_table.public: Refreshing state... [id=rtb-087a887da8415bdff]
module.https_sg.aws_security_group.sg: Refreshing state... [id=sg-0679502cda57e36c2]
module.network.aws_internet_gateway.igw: Refreshing state... [id=igw-0ac9a9002bdd045b7]
module.ecs_service_sg.aws_security_group.sg: Refreshing state... [id=sg-0c953dec6cf4350c5]
module.http_sg.aws_security_group.sg: Refreshing state... [id=sg-020fa9967c140a6e3]
module.network.aws_subnet.public["ap-northeast-1a"]: Refreshing state... [id=subnet-0f5769fab850ba4bf]
module.http_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-4164028779]
module.http_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-3526099007]
module.network.aws_route.public: Refreshing state... [id=r-rtb-087a887da8415bdff1080289494]
module.https_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-277310025]
module.https_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-1487212442]
module.ecs_service_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-3114636339]
module.ecs_service_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-1519276580]
module.alb.aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:762742784206:loadbalancer/app/machamp-staging-alb/494f35997016adc0]
module.network.aws_route_table_association.public["ap-northeast-1c"]: Refreshing state... [id=rtbassoc-0f6bf83bb9017e085]
module.network.aws_route_table_association.public["ap-northeast-1a"]: Refreshing state... [id=rtbassoc-03c2cb8006b96ede9]
module.alb.aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:762742784206:targetgroup/example/76ad894c36a5743c]
module.alb.aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:762742784206:listener/app/machamp-staging-alb/494f35997016adc0/2cc888293b062165]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ecs.aws_ecs_service.service will be created
  + resource "aws_ecs_service" "service" {
      + cluster                            = "arn:aws:ecs:ap-northeast-1:762742784206:cluster/machamp-staging-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + health_check_grace_period_seconds  = 60
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "machamp-staging-service"
      + platform_version                   = "1.4.0"
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = "arn:aws:ecs:ap-northeast-1:762742784206:task-definition/ecs-demo:3"
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "nginx"
          + container_port   = 80
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:762742784206:targetgroup/example/76ad894c36a5743c"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0c953dec6cf4350c5",
            ]
          + subnets          = [
              + "subnet-058faf506e28b7ed9",
              + "subnet-0f5769fab850ba4bf",
            ]
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


```

</details>